package project.Hamster.src;

public class AnimalInfo {
  static String dog[] = {

	"<html>강아지를 키우다 보면 내가 먹는 음식을 주고 싶을 때가 있다.<br>" + 
	"하지만 이때 줘도 되는 음식과 안 되는 음식이 있다. 순대 간,<br>" + 
	"계란 노른자, 고구마, 당근, 오이와 같은 음식은 먹어도 되지만 <br>" + 
	"포도, 고등어, 초콜릿, 모든 과일씨, 아몬드 등은 먹으면 안 된다. <br>" + 
	"소량이라도 강아지에게는 큰 영향을 끼칠 수 있으니 조심해야 한다.<br></html>",
	
	"<html>강아지에게 간식을 줄 때 아무 생각 없이 손가락으로 집어서 줄 때가 있는데 조심해야 한다.<br>" + 
	"몇몇 강아지들은 잘 먹기도 하지만 잘못하다가는 손가락을 물릴 수도 있다.<br>" + 
	"그래서 간식을 줄 때는 꼭 손바닥에 올려놓고 주어야 한다.<br></html>",
	
	"<html>강아지와 함께 지내다 보면 같이 자고 싶을 수도 있다.<br>" + 
	"강아지가 자는 곳을 구분해 놓으면 좋은 점도 있지만 안 좋은 점도 있다.<br>" + 
	"우선 함께 자게 된다면 강아지와의 친밀감은 높아지겠지만 잠자리 공간 자기 영역과<br>" + 
	"주인 보호본능이 더 강하게 나타나고 표출됨으로써 누군가 자기 영역공간에 들어오면<br>" + 
	"많이 짖는 버릇이 생겨난다. 함께 자지 않으면 영역이 나누어져 있어 잘 짖지 않는다.</html>"		
  };
  
  static String cat[] = {
		  
		  "<html>간혹 베란다에는 방범창이 설치되어 있지 않은 곳이 있다. 베란다에 화장실을 설치하게 되었는데 <br>"+
		  "혹여나 창문이라도 열려 있으면 탈출의 위험이 있다. 베란다보단 거실이 더 안전하다. <br>"+
		  "하지만 고양이가 음식을 먹는 장소나 잠을 자는 곳, 놀이를 하는 장소와 서로 가까우면 좋지 않다. <br>"+
		  "고양이의 배설물은 매우 독특하고 강한 냄새를 풍긴다. 이 냄새는 영역표시의 기능도 하지만 적에게 <br>"+
		  "자신의 위치를 알려 위험에 처할 수도 있기 때문에 고양이는 자신의 보금자리와 어느 정도 <br>"+
		  "떨어진 곳에 화장실이 있기를 원한다. 조용하고 통풍이 잘 되며 깨끗한 장소가 가장 이상적이다.</html>",
		  
		  "<html>고양이가 털실을 가지고 노는 이미지가 강렬하지만 사실 고양이에게 털실은<br>"+ 
		  "위험한 물건이 될 수 있다. 가지고 놀다가 삼킬 수 있고 몸에 감겨서 부상 당하기가 쉽다.<br>"+ 
		  "또 만화를 보면 고양이가 우유와 생선을 좋아하는 듯한 장면들이 많이 등장하곤한다. 하지만 <br>"+
		  "우유도 사람이 먹는 일반 우유가 아니라 고양이 전용 우유를 준비해야한다. 대부분의 고양이는 <br>"+
		  "우유의 젖당을 분해할 수 없고, 우유 섭취는 설사나 알레르기를 일으킬 수 있다. 생선은 <br>"+
		  "티아미나아제라는 효소가 들어있는데 이는 비타민B의 일종인 티아민이라는 영양소를 파괴한다. <br>"+
		  "티아민이 결핍된 고양이는 식욕이 떨어지고, 발작을 일으키거나 죽음에 이를 수도 있다. 따라서<br>"+ 
		  "가끔 신선한 회 한 조각 정도를 먹이는 것은 괜찮지만 주식으로 주는 것은 위험하다. <br>"+
		  "생선을 익힐 경우 티아미나아제라는 효소를 제거할 수는 있지만, 익힌 생선을 주식으로 <br>"+
		  "급여하는 것은 필수 비타민과 미네랄 섭취를 방해한다.</html>",

           "<html>손으로 놀아주다보면 고양이는 손을 먹이나 장난감으로 생각할 수 있다. <br>"+
           "그렇게 되면 손을 할퀴거나 물게 되는데 주인의 손뿐만이 아니라 <br>수의사같은 다른 사람의 손도 물게 된다는 것이다.<br></html>"
  };
  
 static String hamster[] = {
		  
		  "<html>햄스터가 첫 날 왔을 때 사람들은 핸들링을 시도한다.<br>"+
		  "그러나 햄스터는 2~3일정도의 적응기간이 필요함으로 그 동안은 집도 어둡게 해주어 내버려둔다.<br>"+
		  "첫 날 햄스터와 강제로 스킨쉽을 하려할 경우 강하게 반항할 가능성이 높다.<br>"+
		  "햄스터에게 트라우마가 생길 수도 있어 후에 핸들링이 매우 어려워질 수 있음.</html>",
		  
		  "<html>햄스터와의 핸들링은 천천히 다가가는 것이 매우 중요하다.<br>"+
		  "먹이를 손에 올려두는 위치를 조금씩 바꿔가는 것이다.<br>"
		  + "처음엔 손끝에 먹이를 두고 햄스터가 가까이 올 때까지 기다린다."+
		  "햄스터가 손의 냄새를 익숙하는 것이 보이면 그때 점점 손바닥안으로 먹이의 위치를 옮긴다."
		  + "햄스터가 손바닥위까지 자연스럽게 올라오면 핸들링은 성공이다.</html>",

           "<html>장염은 더러운 환경이 원인으로 기생충에 의해 생기는 병이다.<br>"+
           "햄스터의 케이지는 2주에 한 번 청소하는 것이 필요하다.<br></html>"
  }; 
}
